artillery.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
    - loop:
      - post:
          url: '/api/restaurants'
          json:
            details:
              Today: " "
              Price_Range: "$7 - $17"
              Health_Score: "T"
            hours:
              Mon: "10:00am - 10:00pm"
              Tue: "10:00am - 10:00pm"
              Wed: "10:00am - 10:00pm"
              Thu: "10:00am - 10:00pm"
              Fri: "10:00am - 10:00pm"
              Sat: "10:00am - 10:00pm"
              Sun: "10:00am - 10:00pm"
            misc:
              Dogs_Allowed: "Always"
          capture:
            json: "$.rid"
            as: "id"
      - get:
          url: '/api/restaurants?rid={{ id }}'
      - put:
          url: '/api/restaurants?rid={{ id }}'
          json:
            details:
              Today: " "
              Price_Range: "$7 - $17"
              Health_Score: "T2"
            hours:
              Mon: "10:00am - 10:00pm"
              Tue: "10:00am - 10:00pm"
              Wed: "10:00am - 10:00pm"
              Thu: "10:00am - 10:00pm"
              Fri: "10:00am - 10:00pm"
              Sat: "10:00am - 10:00pm"
              Sun: "10:00am - 10:00pm"
            misc:
              Dogs_Allowed: "Always"
      - delete:
          url: '/api/restaurants?rid={{ id }}'
      count: 10